Revit 2027 API
HostObjectSubcomponentInfo.Depth Property
 The depth of the roof or floor slab.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Depth { get; }
Public ReadOnly Property Depth As Double
	Get
public:
property double Depth {
	double get ();
}
member Depth : float with get
Property Value
Double
Remarks
 The depth is the thickness of the slab as measured perpendicular to the slab's main faces, as opposed to the vertical extrusion distance.
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace